femaleGenderLetters = ["", "ሏ", "ሗ", "ሟ", "ሧ", "ሯ", "ሷ", "ሿ", "ቋ", "ቧ", "ቯ", "ቷ", "ቿ", "ኋ", "ኗ",
                       "ኟ", "ኧ", "ኳ", "ዃ", "", "", "ዟ", "ዧ", "", "ዷ", "ጇ", "ጓ", "ጧ", "ጯ", "ጷ", "ጿ", "", "ፏ", "ፗ"]

seventhLetter = ["ሆ", "ሎ", "ሖ", "ሞ", "ሦ", "ሮ", "ሶ", "ሾ", "ቆ", "ቦ", "ቮ", "ቶ", "ቾ", "ኆ", "ኖ", "ኞ",
                 "ኦ", "ኮ", "ኾ", "ዎ", "ዖ", "ዞ", "ዦ", "ዮ", "ዶ", "ጆ", "ጎ", "ጦ", "ጮ", "ጶ", "ጾ", "ፆ", "ፎ", "ፖ"]
sixthLetter = ["ህ", "ል", "ሕ", "ም", "ሥ", "ር", "ስ", "ሽ", "ቅ", "ብ", "ቭ", "ት", "ች", "ኅ", "ን", "ኝ",
               "እ", "ክ", "ኽ", "ው", "ዕ", "ዝ", "ዥ", "ይ", "ድ", "ጅ", "ግ", "ጥ", "ጭ", "ጵ", "ጽ", "ፅ", "ፍ", "ፕ"]
fifthLetter = ["ሄ", "ሌ", "ሔ", "ሜ", "ሤ", "ሬ", "ሴ", "ሼ", "ቄ", "ቤ", "ቬ", "ቴ", "ቼ", "ኄ", "ኔ", "ኜ", "ኤ", "ኬ", "ኼ", "ዌ", "ዔ",
               "ዜ", "ዤ", "ዬ", "ዴ", "ጄ", "ጌ", "ጤ", "ጬ", "ጴ", "ጼ", "ፄ", "ፌ", "ፔ"]
fourthLetter = ["ሃ", "ላ", "ሓ", "ማ", "ሣ", "ራ", "ሳ", "ሻ", "ቃ", "ባ", "ቫ", "ታ", "ቻ", "ኃ", "ና", "ኛ",
                "ኣ", "ካ", "ኻ", "ዋ", "ዓ", "ዛ", "ዣ", "ያ", "ዳ", "ጃ", "ጋ", "ጣ", "ጫ", "ጳ", "ጻ", "ፃ", "ፋ", "ፓ"]
secondLetter = ["ሁ", "ሉ", "ሑ", "ሙ", "ሡ", "ሩ", "ሱ", "ሹ", "ቁ", "ቡ", "ቩ", "ቱ", "ቹ", "ኁ", "ኑ", "ኙ",
                "ኡ", "ኩ", "ኹ", "ዉ", "ዑ", "ዙ", "ዡ", "ዩ", "ዱ", "ጁ", "ጉ", "ጡ", "ጩ", "ጱ", "ጹ", "ፁ", "ፉ", "ፑ"]
prepositionSuffixes = ["የ", "በ", "ከ", "ለ", "ስለ", "ወደ"]


exceptionWords = ["መአት", "ከበሮ"]
singleWords = ["መነኩሴ", "ሀገር", "ርእስ", "ህዝብ", "ድንግል", "ቄስ",
               "ሊቅ", "እንብሳ", "ንጉስ", "ድብር", "ሃዋርያ", "ዳቦ", "መሮ", "ጌታ", "ሰው", "ቅጠል", "ትንሽ", "እርዛት", "ሪሰርች", "አገር", "መምህር", "ኢትዮጵያ"]
pluralWords = ["መነኮሳት", "አህጉር", "አርእስት", "አህዛብ", "ደናግል", "ቀሳውስት",
               "ሊቃውንት", "እናብስት", "ነገስታት", "እድባራት", "ሃዋርያት", "ዳቦች", "መሮች", "ጌቶች", "ሰዎች", "ቅጠላቅጠል", "ትንንሽ", "እርዝተኛ", "ሪሰርቸር", "አገራት", "መምህርነት", "የኢትዮጵያ"]

pluralSuffixesTwo = ["አት", "ኦች", "ዎች"]

pluralSuffixesOne = ["ች", "ን"]

possessionWords1 = ["ዋ", "ኤ", "ህ ", "ሽ"]
possessionWords2 = ["አችን", "አቸው"]
possessionWord3 = ["ሁ", "ሉ", "ሑ", "ሙ", "ሡ", "ሩ", "ሱ", "ሹ", "ቁ", "ቡ", "ቱ", "ቹ", "ኁ", "ኑ", "ኙ",
                   "ኡ", "ኩ", "ኹ", "ዉ", "ዑ", "ዙ", "ዡ", "ዩ", "ዱ", "ጁ", "ጉ", "ጡ", "ጩ", "ጱ", "ጹ", "ፁ", "ፉ", "ፑ"]
possessionWords4 = ["ሄ", "ሌ", "ሔ", "ሜ", "ሤ", "ሬ", "ሴ", "ሼ", "ቄ", "ቤ", "ቴ", "ቼ", "ኄ", "ኔ", "ኜ",
                    "ኤ", "ኬ", "ኼ", "ዌ", "ዔ", "ዜ", "ዤ", "ዬ", "ዴ", "ጄ", "ጌ", "ጤ", "ጬ", "ጴ", "ጼ", "ፄ", "ፌ", "ፔ"]
possessionWords5 = ["ችን", "ቸው"]
possessionword6 = ["ሃ", "ላ", "ሓ", "ማ", "ሣ", "ራ", "ሳ", "ሻ", "ባ", "ቫ", "ታ", "ቻ", "ኃ", "ና", "ኛ", "ኣ", "ካ", "ኻ", "ዋ", "ዓ", "ዛ",
                   "ዣ", "ያ", "ዳ", "ጃ", "ጋ", "ጣ", "ጫ", "ጳ", "ጻ", "ፃ", "ፋ", "ፓ"]


mis = ["የው", "የዋ", "ዊ", "ነት"]
