femaleGenderLetters = ["", "ሏ", "ሗ", "ሟ", "ሧ", "ሯ", "ሷ", "ሿ", "ቋ", "ቧ", "ቯ", "ቷ", "ቿ", "ኋ", "ኗ",
                       "ኟ", "ኧ", "ኳ", "ዃ", "", "", "ዟ", "ዧ", "", "ዷ", "ጇ", "ጓ", "ጧ", "ጯ", "ጷ", "ጿ", "", "ፏ", "ፗ"]

seventhLetter = ["ሆ", "ሎ", "ሖ", "ሞ", "ሦ", "ሮ", "ሶ", "ሾ", "ቆ", "ቦ", "ቮ", "ቶ", "ቾ", "ኆ", "ኖ", "ኞ",
                 "ኦ", "ኮ", "ኾ", "ዎ", "ዖ", "ዞ", "ዦ", "ዮ", "ዶ", "ጆ", "ጎ", "ጦ", "ጮ", "ጶ", "ጾ", "ፆ", "ፎ", "ፖ"]
sixthLetter = ["ህ", "ል", "ሕ", "ም", "ሥ", "ር", "ስ", "ሽ", "ቅ", "ብ", "ቭ", "ት", "ች", "ኅ", "ን", "ኝ",
               "እ", "ክ", "ኽ", "ው", "ዕ", "ዝ", "ዥ", "ይ", "ድ", "ጅ", "ግ", "ጥ", "ጭ", "ጵ", "ጽ", "ፅ", "ፍ", "ፕ"]
fifthLetter = ["ሄ", "ሌ", "ሔ", "ሜ", "ሤ", "ሬ", "ሴ", "ሼ", "ቄ", "ቤ", "ቬ", "ቴ", "ቼ", "ኄ", "ኔ", "ኜ", "ኤ", "ኬ", "ኼ", "ዌ", "ዔ",
               "ዜ", "ዤ", "ዬ", "ዴ", "ጄ", "ጌ", "ጤ", "ጬ", "ጴ", "ጼ", "ፄ", "ፌ", "ፔ"]
fourthLetter = ["ሃ", "ላ", "ሓ", "ማ", "ሣ", "ራ", "ሳ", "ሻ", "ቃ", "ባ", "ቫ", "ታ", "ቻ", "ኃ", "ና", "ኛ",
                "ኣ", "ካ", "ኻ", "ዋ", "ዓ", "ዛ", "ዣ", "ያ", "ዳ", "ጃ", "ጋ", "ጣ", "ጫ", "ጳ", "ጻ", "ፃ", "ፋ", "ፓ"]
secondLetter = ["ሁ", "ሉ", "ሑ", "ሙ", "ሡ", "ሩ", "ሱ", "ሹ", "ቁ", "ቡ", "ቩ", "ቱ", "ቹ", "ኁ", "ኑ", "ኙ",
                "ኡ", "ኩ", "ኹ", "ዉ", "ዑ", "ዙ", "ዡ", "ዩ", "ዱ", "ጁ", "ጉ", "ጡ", "ጩ", "ጱ", "ጹ", "ፁ", "ፉ", "ፑ"]
prepositionSuffixes = ["የ", "በ", "ከ", "ለ", "ስለ", "ወደ"]


exceptionWords = ["መአት", "ከበሮ"]
singleWords = ["መነኩሴ", "ሀገር", "ርእስ", "ህዝብ", "ድንግል", "ቄስ",
               "ሊቅ", "እንብሳ", "ንጉስ", "ድብር", "ሃዋርያ", "ዳቦ", "መሮ", "ጌታ", "ሰው", "ቅጠል", "ትንሽ", "እርዛት", "ሪሰርች", "አገር", "መምህር", "ኢትዮጵያ", "ማምለጥ", "ደራሲ", "ትግል", "ለውጥ", "ፖለቲካ"]
pluralWords = ["መነኮሳት", "አህጉር", "አርእስት", "አህዛብ", "ደናግል", "ቀሳውስት",
               "ሊቃውንት", "እናብስት", "ነገስታት", "እድባራት", "ሃዋርያት", "ዳቦች", "መሮች", "ጌቶች", "ሰዎች", "ቅጠላቅጠል", "ትንንሽ", "እርዝተኛ", "ሪሰርቸር", "አገራት", "መምህርነት", "የኢትዮጵያ", "ሲያስመልጧቸው", "ደራሲያን", "ማታገል", "ለውጦች", "ፖለቲከኛ"]

pluralSuffixesTwo = ["አት", "ኦች", "ዎች"]

pluralSuffixesOne = ["ች", "ን"]

possessionWords1 = ["ዋ", "ኤ", "ህ ", "ሽ", "ን"]
possessionWords2 = ["አችን", "አቸው"]
possessionWord3 = ["ሁ", "ሉ", "ሑ", "ሙ", "ሡ", "ሩ", "ሱ", "ሹ", "ቁ", "ቡ", "ቱ", "ቹ", "ኁ", "ኑ", "ኙ",
                   "ኡ", "ኩ", "ኹ", "ዉ", "ዑ", "ዙ", "ዡ", "ዩ", "ዱ", "ጁ", "ጉ", "ጡ", "ጩ", "ጱ", "ጹ", "ፁ", "ፉ", "ፑ"]
possessionWords4 = ["ሄ", "ሌ", "ሔ", "ሜ", "ሤ", "ሬ", "ሴ", "ሼ", "ቄ", "ቤ", "ቴ", "ቼ", "ኄ", "ኔ", "ኜ",
                    "ኤ", "ኬ", "ኼ", "ዌ", "ዔ", "ዜ", "ዤ", "ዬ", "ዴ", "ጄ", "ጌ", "ጤ", "ጬ", "ጴ", "ጼ", "ፄ", "ፌ", "ፔ"]
possessionWords5 = ["ችን", "ቸው"]
possessionword6 = ["ሃ", "ላ", "ሓ", "ማ", "ሣ", "ራ", "ሳ", "ሻ", "ባ", "ቫ", "ታ", "ቻ", "ኃ", "ና", "ኛ", "ኣ", "ካ", "ኻ", "ዋ", "ዓ", "ዛ",
                   "ዣ", "ያ", "ዳ", "ጃ", "ጋ", "ጣ", "ጫ", "ጳ", "ጻ", "ፃ", "ፋ", "ፓ"]


mis = ["የው", "የዋ", "ዊ", "ነት"]


StopWords = [
    "ስለሚሆን", "አና", "ስለዚህ", "በመሆኑም", "ሁሉ", "ሆነ", "ሌላ", "ልክ", "ስለ", "በቀር", "ብቻ", "ና", "አንዳች", "አንድ",
    "እንደ", "እንጂ", "ያህል", "ይልቅ", "ወደ", "እኔ", "የእኔ", "ራሴ", "እኛ",  "የእኛ",  "እራሳችን", "አንቺ",  "የእርስዎ",
    "ራስህ", "ራሳችሁ", "እሱ", "እሱን", "የእሱ", "ራሱ",  "እርሷ",  "የእሷ",  "ራሷ",  "እነሱ",  "እነሱን",  "የእነሱ",
    "እራሳቸው", "ምንድን",  "የትኛው", "ማንን", "ይህ",  "እነዚህ",  "እነዚያ",  "ነኝ",  "ነው",  "ናቸው",  "ነበር",
    "ነበሩ", "ሁን", "ነበር",  "መሆን",  "አለኝ",  "አለው",  "ነበረ",  "መኖር",  "ያደርጋል",  "አደረገው",  "መሥራት",  "እና", "ግን",  "ከሆነ",  "ወይም",
    "ምክንያቱም", "እስከ", "ቢሆንም", "ጋር", "ላይ", "መካከል", "በኩል", "ወቅት",  "በኋላ",  "ከላይ", "በርቷል", "ጠፍቷል", "በላይ", "ስር", "እንደገና", "ተጨማሪ",
    "ከዚያ", "አንዴ", "እዚህ", "እዚያ", "መቼ", "የት", "እንዴት", "ሁሉም", "ማናቸውም", "ሁለቱም", "እያንዳንዱ", "ጥቂቶች",
    "ተጨማሪ", "በጣም", "ሌላ", "አንዳንድ", "አይ", "ወይም", "አይደለም", "ብቻ", "የራስ", "ተመሳሳይ", "ስለዚህ", "እኔም",
    "በጣም", "ይችላል", "ይሆናል", "በቃ", "አሁን", "በተጨማሪም", "ሲሆን", "በተለያዩ", "ተለያዩ", "ቆይተዋል", "እያገለግሉ", "ይታወቃሉ",  "ይገኙበታለል", "ይገኛል", "ይነገራል", "ደሞ", "ከነበሩት", "የነበረ", "ሆኑ", "'ሄደው"
    "ከዚያም", "ያዘወትራል", "አቅርቦልናል", "ሚባለው", "ብዙ", "በመሆን", "ሆነዋል", 'ቀደም', 'ባሉት', 'ጊዜያት',
    "ሳይሆን", "ለበለጡ", "ብቻ", "ችሏል", "ይሁንና", "ለማንም", "በዚያ", "ላይ", "አጠናቀዋል", "መካከል",
    "አግኝተዋል", "ነበሩ", "ውስጥ", "በቅቷል", "ሊሆን", "ባለመቻሉ", "በነበረው", "አድርገዋል", "አከናውነዋል", "የተባሉት",
    "የነበሩት", "ይገኙበታለል", "አበርክተዋል", "ሆነዋል", "እዛው", "በሚገኘው", "በበርካታ", "ሠርቷል", "አካሂዷል", "ወደ", "በሌሎች",
    "ላይ", "አጠናቋል", "ከዚህ", "በተጨማሪ", "እንዲሁም", "አድርጓል", "አንዱ", "ይታወቃል", "የሆነውን", "ይታወሳል", "ይነገራል", "የሚጠቀስ", "ተሳትፈዋል",
    "በቀዳሚነት", "በአብዛኛው", "በዚህን", "ብኋላም", "በተሰኘችው", "ስፍራ", "በነበረ", "በላቀ", "መልኩ", "ልዩ", "ሆኖ", "ተጠቃሽ", "በዛ", "ውስጥ", "ሆነው", "ና", "የተለያዩ", "እስካሁንም",
    "ይህ", "የሆነውን", "ደግሞ", "ከነዚሁም", "ለመሆን", "ከነ", "ነህ", "ከነሱ", "አልያም", "ከዚህ", "የለኝም", "ነበሩ", "እሳቸው", "እንደነ", "ሌሎችም", "በቅተዋል", "በቅታለች", "እጅግ", "የሆነ", "ሲሉ",
    "ብለው", "ካለው", "ይኖረዋል", "መኾን", "የለበትም", "ይኹን", "እኮ", "የነ", "ቢሆኑም"
]
